# __Pandas__
구조적 데이터 표시 및 처리에 특화.  
데이터 분석 및 처리를 쉽게 해줌.

In [2]:
import pandas as pd
import numpy as np
def p(*t): print(*t); return

### __Series__　- 인덱스만 있는 데이터  
인덱스를 편집하는 것까지 가능. 사실상 date_range 메소드땜에 존재.

In [2]:
series = pd.Series([10, 20, 30, 40, 50])
series                                   # 인덱스는 자동 생성.

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
p( series.index )
p( series.values )
series02 = pd.Series(["a","b","c",11,33,22, np.nan])
p( series02 )

RangeIndex(start=0, stop=5, step=1)
[10 20 30 40 50]
0      a
1      b
2      c
3     11
4     33
5     22
6    NaN
dtype: object

In [4]:
dates = ['2018-10-07','2018-10-08','2018-10-09','2018-10-10']
series_dates = pd.Series([200, 195, np.nan, 205], index = dates)
p( series_dates )               # index를 직접 지정했다.

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [5]:
dict_data = {'국어': 100, '영어': 95, '수학': 90}
series_dict = pd.Series(dict_data)
p( series_dict )         # dict를 가져오면 key가 index로 들어간다.

국어    100
영어     95
수학     90
dtype: int64

### __Series 연산하기__　- 데이터 크기가 같은 경우와 다른 경우

In [6]:
# 데이터 크기가 같을 때
s1 = pd.Series([10, 20, 30, 40, 50])
s2 = pd.Series([1, 2, 3, 4, 5])
p( s1 + s2 )
p( s1 - s2 )
p( s1 * s2 )
p( s1 / s2 )

0    11
1    22
2    33
3    44
4    55
dtype: int64
0     9
1    18
2    27
3    36
4    45
dtype: int64
0     10
1     40
2     90
3    160
4    250
dtype: int64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [7]:
# 데이터 크기가 다를 때.  데이터 크기가 다른 부분은 NaN이 입력되면서 전체 데이터 타입도 float으로 바뀐다.
s1 = pd.Series([10, 20, 30, 40, 50])       # NaN : Not a Number, 결측치
s2 = pd.Series([1, 2, 3, 4])
p( s1 + s2 )
p( s1 - s2 )
p( s1 * s2 )
p( s1 / s2 )

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64
0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64
0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64
0    10.0
1    10.0
2    10.0
3    10.0
4     NaN
dtype: float64

### __date_range 날짜 자동 생성__
pd.date_range(start=None, end=None, periods=None, freq='D')  
날짜 표현은 다음 모두가 같다. 혼용 가능.  
'2019-01-07'　'2019/01/07'　'2019.01.07'　월일년도 가능　'01-01-2019'　'01/07/2019'　'01.07.2019'

In [8]:
pd.date_range(start='2019-01-01',end='2019-01-07')  # 시작일부터 End일까지 리턴. index가 아닌 string으로 지정했기 때문에 End 포함 주의.

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

__date_range의 freq 매개변수 종류들__  
![date_range_freq](etc/pandas_date_range_freq.PNG)

In [9]:
p( pd.date_range(start='2019-01-01', periods = 4, freq = '2D') )
p( pd.date_range(start='2019-01-01', periods = 4, freq = 'W') )
p( pd.date_range(start='2019-01-01', periods = 8, freq = '2BM') )
p( pd.date_range(start='2019-01-01', periods = 4, freq = 'QS') )
p( pd.date_range(start='2019-01-01', periods = 3, freq = 'AS') )

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')
DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27'], dtype='datetime64[ns]', freq='W-SUN')
DatetimeIndex(['2019-01-31', '2019-03-29', '2019-05-31', '2019-07-31',
               '2019-09-30', '2019-11-29', '2020-01-31', '2020-03-31'],
              dtype='datetime64[ns]', freq='2BM')
DatetimeIndex(['2019-01-01', '2019-04-01', '2019-07-01', '2019-10-01'], dtype='datetime64[ns]', freq='QS-JAN')
DatetimeIndex(['2019-01-01', '2020-01-01', '2021-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

In [10]:
p( pd.date_range(start = '2019-01-01 08:00', periods = 10, freq='H') )
p( pd.date_range(start = '2019-01-01 08:00', periods = 10, freq='BH') )
p( pd.date_range(start = '2019-01-01 10:00', periods = 4, freq='30min') )
p( pd.date_range(start = '2019-01-01 10:00', periods = 4, freq='30T') )

DatetimeIndex(['2019-01-01 08:00:00', '2019-01-01 09:00:00',
               '2019-01-01 10:00:00', '2019-01-01 11:00:00',
               '2019-01-01 12:00:00', '2019-01-01 13:00:00',
               '2019-01-01 14:00:00', '2019-01-01 15:00:00',
               '2019-01-01 16:00:00', '2019-01-01 17:00:00'],
              dtype='datetime64[ns]', freq='H')
DatetimeIndex(['2019-01-01 09:00:00', '2019-01-01 10:00:00',
               '2019-01-01 11:00:00', '2019-01-01 12:00:00',
               '2019-01-01 13:00:00', '2019-01-01 14:00:00',
               '2019-01-01 15:00:00', '2019-01-01 16:00:00',
               '2019-01-02 09:00:00', '2019-01-02 10:00:00'],
              dtype='datetime64[ns]', freq='BH')
DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')
DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [11]:
index_date = pd.date_range(start = '2019-03-01', periods = 5, freq='D')
pd.Series([51, 62, 55, 49, 58], index = index_date )

2019-03-01    51
2019-03-02    62
2019-03-03    55
2019-03-04    49
2019-03-05    58
Freq: D, dtype: int64

---

# __DataFrame__
DataFrame은 Table(표)과 같은 2차원 데이터를 처리하기 위한 형식이다.  
class DataFrame(pandas.core.generic.NDFrame, pandas.core.arraylike.OpsMixin)  
DataFrame(data=None, index: 'Axes | None' = None, columns: 'Axes | None' = None, dtype: 'Dtype | None' = None, copy: 'bool | None' = None) -> 'None'  
df = pd.DataFrame(data [, index = index_data, columns = columns_data])  
<br>
__데이터 처리 순서: NaN 처리. -> 중복데이터 처리(중복데이터가 편향을 일으키는지 확인하고 처리해야 함.)   -> 마지막으로 정규화__  
<br>
  ![dataframe's_structure](etc/dataframe's_structure.PNG)

In [12]:
pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])   # value만 넣으면 index와 columns는 자동으로 생성된다.
#pd.DataFrame([1,2,3], [4])   # 데이터가 안 맞아서 오류남.

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8 ,9], [10, 11, 12]])
index_date = pd.date_range('2019-09-01', periods=4)
columns_list = ['A', 'B', 'C']
pd.DataFrame(data, index=index_date, columns=columns_list)   # 앞에서 배운 내용들이 총 집합

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

In [14]:
table_data = {'연도': [2015, 2016, 2016, 2017, 2017],
              '지사': ['한국', '한국', '미국', '한국','미국'],
              '고객 수': [200, 250, 450, 300, 500]}
pd.DataFrame(table_data)                                   # dict를 받으면 key가 columns로 간다.

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

In [15]:
pd.DataFrame(table_data, columns=['지사', '연도', '고객 수'])   # dict를 받을 때, columns 순서가 맘에 안들면 직접 바꿔 넣을 수도 있다.

   지사    연도  고객 수
0  한국  2015   200
1  한국  2016   250
2  미국  2016   450
3  한국  2017   300
4  미국  2017   500

In [16]:
df = pd.DataFrame(table_data)
p( df.index )
p( df.columns )
p( df.values )

RangeIndex(start=0, stop=5, step=1)
Index(['연도', '지사', '고객 수'], dtype='object')
[[2015 '한국' 200]
 [2016 '한국' 250]
 [2016 '미국' 450]
 [2017 '한국' 300]
 [2017 '미국' 500]]

### __DataFrame 연산하기__

In [17]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                    'B': [10, 20, 30, 40, 50],
                    'C': [100, 200, 300, 400, 500]})
df2 = pd.DataFrame({'A': [6, 7, 8],
                    'B': [60, 70, 80],
                    'C': [600, 700, 800]})
p( df1 + df2 )
p( df1 - df2 )
p( df1 * df2 )
p( df1 / df2 )

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN
     A     B      C
0 -5.0 -50.0 -500.0
1 -5.0 -50.0 -500.0
2 -5.0 -50.0 -500.0
3  NaN   NaN    NaN
4  NaN   NaN    NaN
      A       B         C
0   6.0   600.0   60000.0
1  14.0  1400.0  140000.0
2  24.0  2400.0  240000.0
3   NaN     NaN       NaN
4   NaN     NaN       NaN
          A         B         C
0  0.166667  0.166667  0.166667
1  0.285714  0.285714  0.285714
2  0.375000  0.375000  0.375000
3       NaN       NaN       NaN
4       NaN       NaN       NaN

### __통계 분석을 위한 메서드__

In [10]:
table_data3 = {'봄': [256.5, 264.3, 215.9, 223.2, 312.8, 254.5],
'여름': [770.6, 567.5, 599.8, 387.1, 446.2, 554.2],
'가을': [363.5, 231.2, 293.1, 247.7, 381.6, 303.4],
'겨울': [139.3, 59.9, 76.9, 109.1, 108.1, 98.7],
'겨겨울': [np.nan, np.nan, np.nan, 2395, 3786, 6667]}
columns_list = ['봄', '여름', '가을', '겨울', '겨겨울']
index_list = ['2012', '2013', '2014', '2015', '2016', '2017']
seasons = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
seasons

          봄     여름     가을     겨울     겨겨울
2012  256.5  770.6  363.5  139.3     NaN
2013  264.3  567.5  231.2   59.9     NaN
2014  215.9  599.8  293.1   76.9     NaN
2015  223.2  387.1  247.7  109.1  2395.0
2016  312.8  446.2  381.6  108.1  3786.0
2017  254.5  554.2  303.4   98.7  6667.0

In [11]:
p( seasons.mean() )          # 그냥 하면 columns 기준.
p( seasons.std() )           
p( seasons.mean(axis=1) )    # index기준 즉, row 기준으로 평균값을 리턴한다.
p( seasons.std(axis=1) )

봄       254.533333
여름      554.233333
가을      303.416667
겨울       98.666667
겨겨울    4282.666667
dtype: float64
봄        34.550176
여름      133.170277
가을       60.247271
겨울       27.660634
겨겨울    2178.876851
dtype: float64
2012     382.475
2013     280.725
2014     296.425
2015     672.420
2016    1006.940
2017    1575.560
dtype: float64
2012     274.472128
2013     211.128782
2014     221.150739
2015     968.014007
2016    1558.717232
2017    2850.905276
dtype: float64

#### __DataFrame.describe(percentiles=None, include=None, exclude=None, datetime_is_numeric=False)__
percentiles: 백분위수를 지정할 수 있는 리스트를 받습니다. 기본값은 [.25, .5, .75]로 25%, 50%, 75%의 백분위수를 보여줍니다.  
include, exclude: 통계를 계산할 열을 선택하기 위한 조건을 지정할 수 있는 매개변수입니다.  
datetime_is_numeric: 날짜형 데이터를 수치형 데이터로 취급할지 여부를 지정합니다.

In [12]:
seasons.describe()

                봄          여름          가을          겨울          겨겨울
count    6.000000    6.000000    6.000000    6.000000     3.000000
mean   254.533333  554.233333  303.416667   98.666667  4282.666667
std     34.550176  133.170277   60.247271   27.660634  2178.876851
min    215.900000  387.100000  231.200000   59.900000  2395.000000
25%    231.025000  473.200000  259.050000   82.350000  3090.500000
50%    255.500000  560.850000  298.250000  103.400000  3786.000000
75%    262.350000  591.725000  348.475000  108.850000  5226.500000
max    312.800000  770.600000  381.600000  139.300000  6667.000000

### __DataFrame　- Indexing, Slicing__

In [15]:
seasons["가을"]      # 열을 찾는 방법은 쉽다. 열은 자체적으로 Key 역할을 함.

2012    363.5
2013    231.2
2014    293.1
2015    247.7
2016    381.6
2017    303.4
Name: 가을, dtype: float64

In [13]:
seasons.head()

          봄     여름     가을     겨울     겨겨울
2012  256.5  770.6  363.5  139.3     NaN
2013  264.3  567.5  231.2   59.9     NaN
2014  215.9  599.8  293.1   76.9     NaN
2015  223.2  387.1  247.7  109.1  2395.0
2016  312.8  446.2  381.6  108.1  3786.0

In [14]:
seasons.tail(3)

          봄     여름     가을     겨울     겨겨울
2015  223.2  387.1  247.7  109.1  2395.0
2016  312.8  446.2  381.6  108.1  3786.0
2017  254.5  554.2  303.4   98.7  6667.0

In [16]:
#seasons[3]   이건 에러다.
seasons[1:3]

          봄     여름     가을    겨울  겨겨울
2013  264.3  567.5  231.2  59.9  NaN
2014  215.9  599.8  293.1  76.9  NaN

In [17]:
seasons.loc["2012"]

봄      256.5
여름     770.6
가을     363.5
겨울     139.3
겨겨울      NaN
Name: 2012, dtype: float64

In [18]:
seasons.loc["2013":"2016"]

          봄     여름     가을     겨울     겨겨울
2013  264.3  567.5  231.2   59.9     NaN
2014  215.9  599.8  293.1   76.9     NaN
2015  223.2  387.1  247.7  109.1  2395.0
2016  312.8  446.2  381.6  108.1  3786.0

In [19]:
seasons["여름"]["2013":"2015"]      # index 로 indexing 안하고 직접 string으로 지정했기 때문에 마지막이 포함됨.

2013    567.5
2014    599.8
2015    387.1
Name: 여름, dtype: float64

In [20]:
seasons["봄"][2:4]

2014    215.9
2015    223.2
Name: 봄, dtype: float64

In [22]:
# 한 데이터만 콕 집기 
p( seasons.loc['2016']['겨울'] )
p( seasons.loc['2016','겨울'] )
p( seasons['겨울']['2016'] )      # 이게 제일 쉬운듯
p( seasons['겨울'][4] )
p( seasons['겨울'].loc['2016'] )

108.1
108.1
108.1
108.1
108.1

In [23]:
seasons.transpose()

      2012   2013   2014    2015    2016    2017
봄    256.5  264.3  215.9   223.2   312.8   254.5
여름   770.6  567.5  599.8   387.1   446.2   554.2
가을   363.5  231.2  293.1   247.7   381.6   303.4
겨울   139.3   59.9   76.9   109.1   108.1    98.7
겨겨울    NaN    NaN    NaN  2395.0  3786.0  6667.0

In [24]:
seasons.T

      2012   2013   2014    2015    2016    2017
봄    256.5  264.3  215.9   223.2   312.8   254.5
여름   770.6  567.5  599.8   387.1   446.2   554.2
가을   363.5  231.2  293.1   247.7   381.6   303.4
겨울   139.3   59.9   76.9   109.1   108.1    98.7
겨겨울    NaN    NaN    NaN  2395.0  3786.0  6667.0

In [25]:
# 열 순서 바꾸기 + '겨겨울' 빼고 보기
seasons[['여름', '겨울', '봄', '가을']]

         여름     겨울      봄     가을
2012  770.6  139.3  256.5  363.5
2013  567.5   59.9  264.3  231.2
2014  599.8   76.9  215.9  293.1
2015  387.1  109.1  223.2  247.7
2016  446.2  108.1  312.8  381.6
2017  554.2   98.7  254.5  303.4

### __DataFrame　- Concat Join Merge__
Pandas 2.0 no more supports the append method.

#### __concat__ = concatenate
Append data to the row direction.

In [35]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
df2 = pd.DataFrame({'Class1': [87, 89],
                    'Class2': [85, 90]})
p( df1, "\n", df2 ,"\n")
res = pd.concat((df1, df2))
res

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
    Class1  Class2
0      87      85
1      89      90

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [36]:
res = pd.concat([df1, df2], ignore_index=True)
res

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [37]:
df3 = pd.DataFrame({'Class1': [96, 83]})
p( df3 )
res = pd.concat((df2, df3), ignore_index=True)
res                    # df3에는 class2 데이터가 없기 때문에 concat 후에 NaN이 뜬다.

   Class1
0      96
1      83

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

#### __join__ 
Append data to the column direction.

In [38]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
p( df4 )
df1.join(df4)

   Class3
0      93
1      91
2      95
3      98

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [39]:
# index label을 지정한 경우.
my_index_label = ["a","b","c","d"]
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100], 'Class2': [91, 93, 97, 99]}, index= my_index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=my_index_label)
df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [40]:
# index label이 다를 경우. 같은 항목만 join 되고 없는 데이터는 Nan.
my_index_label = ["a","b","c","d"]
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100], 'Class2': [91, 93, 97, 99]}, index= my_index_label)
my_index_label = ["a","b","G","E"]
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=my_index_label)
df1a.join(df4a)

   Class1  Class2  Class3
a      95      91    93.0
b      92      93    91.0
c      98      97     NaN
d     100      99     NaN

#### __merge__ 
DataFrame_left_data.merge(DataFrame_right_data)

In [41]:
df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'], '제품A': [100, 150, 200, 130], '제품B': [90, 110, 140, 170]})
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'], '제품C': [112, 141, 203, 134], '제품D': [90, 110, 140, 170]})
p( df_A_B, "\n", df_C_D, "\n")
df_A_B.merge(df_C_D)

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170
   판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

---

DataFrame_left_data.merge(DataFrame_right_data, how=merge_method, on=key_label)  
how의 종류  
__left__　　왼쪽에 맞춰 오른쪽 데이터를 다듬는다.  
__right__　 오른쪽에 맞춰 왼쪽 데이터를 다듬는다.  
__outer__　합집합으로 merge  
__inner__　교집합으로 merge  (default)

In [42]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left': [1, 2, 3]})
df_right = pd.DataFrame({'key':['A','B','D'], 'right': [4, 5, 6]})
p( df_left, "\n", df_right , "\n")
df_left.merge(df_right, on = "key")

  key  left
0   A     1
1   B     2
2   C     3
   key  right
0   A      4
1   B      5
2   D      6

  key  left  right
0   A     1      4
1   B     2      5

In [43]:
df_left.merge(df_right, how='left', on = 'key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [44]:
df_left.merge(df_right, how='right', on = 'key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [45]:
df_left.merge(df_right, how='outer', on = 'key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

### __DataFrame　- Save & Read__
정말 다양한 타입을 입출력할 수 있다. EXCEL, JSON, XML, SQL, CSV(comma separated values) ...

In [46]:
%%writefile etc/sea_rain.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Overwriting etc/sea_rain.csv

In [47]:
pd.read_csv('etc/sea_rain.csv')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [48]:
#pd.read_csv('sea_rain.csv', encoding = "cp949") # what the
pd.read_csv('etc/sea_rain.csv', encoding = "utf-8")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [49]:
pd.read_csv('etc/sea_rain.txt', sep=" ")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [50]:
pd.read_csv('etc/sea_rain.csv', index_col="연도" )

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

---

In [51]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74], 'Height':[165, 177, 160, 180]},
index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [52]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [53]:
df_WH['BMI'] = bmi       # join 없이도 되네?
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [54]:
df_WH.to_csv('etc/weight_height_bmi.csv')
#!type weight_height_bmi.csv
pd.read_csv('etc/weight_height_bmi.csv')

   User  Weight  Height        BMI
0  ID_1      62     165  22.773186
1  ID_2      67     177  21.385936
2  ID_3      55     160  21.484375
3  ID_4      74     180  22.839506

In [55]:
df_pr = pd.DataFrame({'판매가격':[2000, 3000, 5000, 10000], '판매량':[32, 53, 40, 25]}, index=['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [56]:
file_name = 'etc/save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep=" ", encoding = "cp949")
#pd.read_csv('save_DataFrame_cp949.txt')            < cp949로 인코딩 시 이거 오류남. 이유는 아직 못 찾음.
!type etc/save_DataFrame_cp949.txt

명령 구문이 올바르지 않습니다.

---

# __DataFrame　- 실전편__

In [5]:
df_WHO = pd.read_csv('Pandas/data/WHO_first9cols.csv')
df_WHO.to_csv('etc/세계보건기구_9개컬럼02.csv',index=False)  # index는 저장하지 않는다.
df = pd.read_csv('etc/세계보건기구_9개컬럼02.csv')
p( df.shape )
p( len(df) )

(202, 9)
202